<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of VLC media player and creates a package.</string>
	<key>Identifier</key>
	<string>vlc.pkg.VLCmediaplayer</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>VLC</string>
		<key>NAME</key>
		<string>VLC media player</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>vlc.download.VLCmediaplayer</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>vlc.download.VLCmediaplayer</key>
			<dict>
				<key>git_hash</key>
				<string>f789400411ef4633a1b27c1c44df0e9466a4cec7</string>
				<key>path</key>
				<string>/Users/uscahg/Library/CloudStorage/OneDrive-GrupoPlaneta/Documents/GitHub/jamftest/VLC media player/VLC media player.download.recipe</string>
				<key>sha256_hash</key>
				<string>dc3afe2c36c103e99876498a9f536df6d2ae2f2e7b21c6827679fc9bbf2e8e90</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
