<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Recipe automatically generated from com.github.novaksam.jss.VLC by JamfRecipeMaker</string>
	<key>Identifier</key>
	<string>vlc.upload.jamf.VLCmediaplayer</string>	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Media</string>
		<key>NAME</key>
		<string>VLC</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>vlc.pkg.VLCmediaplayer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category_name</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.aitorhergon.jamftest.JamfUploaderProcessors/JamfCategoryUploader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_category</key>
				<string>%CATEGORY%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.aitorhergon.jamftest.JamfUploaderProcessors/JamfPatchUploader</string>
		</dict>
	</array>
</dict>
</plist>