<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of VLC media player and creates a package.</string>
	<key>Identifier</key>
	<string>aitorhergon.pkg.VLCmediaplayer</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>VLC</string>
		<key>NAME</key>
		<string>VLC media player</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>aitorhergon.download.VLCmediaplayer</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>aitorhergon.download.VLCmediaplayer</key>
			<dict>
				<key>git_hash</key>
				<string>85d4065b5a23493ae410282329b83c22e897befc</string>
				<key>path</key>
				<string>~/Library/CloudStorage/OneDrive-GrupoPlaneta/Documents/GitHub/jamftest/Autopkg/VLC media player/VLC media player.download.recipe</string>
				<key>sha256_hash</key>
				<string>2904b795b18f01e70b39f85d5d29430808d0ab6ddb66377e05c8987fbeeac7eb</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
